In [77]:
import pandas as pd
import numpy as np

### 1.

In [29]:
p=pd.DataFrame([{"Name":"Deepika","roll no":"530","age":56},
                {"Name":"haritha","roll no":"542","age":63},
               {"Name":"siri","roll no":"522","age":21}])
p

      Name  age roll no
0  Deepika   56     530
1  haritha   63     542
2     siri   21     522

In [30]:
p.reindex([2,1,0])

      Name  age roll no
2     siri   21     522
1  haritha   63     542
0  Deepika   56     530

### 2.

In [61]:
a=pd.Series([2,4,6,8,10])
a

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [62]:
b=pd.Series([1,3,5,7,9])
b

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [64]:
c=pd.Series(a+b)
c

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [66]:
d=pd.Series(b-a)
d

0   -1
1   -1
2   -1
3   -1
4   -1
dtype: int64

In [68]:
e=pd.Series(b/a)
e

0    0.500000
1    0.750000
2    0.833333
3    0.875000
4    0.900000
dtype: float64

In [70]:
f=pd.Series(a*b)
f

0     2
1    12
2    30
3    56
4    90
dtype: int64

### 3.

In [71]:
p=pd.DataFrame([{"Name":"Deepika","roll no":"530","age":56},
                {"Name":"haritha","roll no":"542","age":63},
               {"Name":"siri","roll no":"522","age":21}])
p

      Name  age roll no
0  Deepika   56     530
1  haritha   63     542
2     siri   21     522

In [72]:
p.loc[2:"age"]=np.nan
p

      Name   age roll no
0  Deepika  56.0     530
1  haritha  63.0     542
2      NaN   NaN     NaN

### 7.

In [74]:
k=np.array([[1,2,3],[4,5,6],[7,8,9]])
k

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [76]:
a=np.ravel(k)
a

array([1, 2, 3, 4, 5, 6, 7, 8, 9])